{
  "_name_or_path": "distilbert-base-multilingual-cased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Fungal Infection",
    "1": "Allergy",
    "2": "GERD",
    "3": "Chronic Cholestasis",
    "4": "Drug Reaction",
    "5": "Peptic Ulcer Disease",
    "6": "AIDS",
    "7": "Diabetes ",
    "8": "Gastroenteritis",
    "9": "Bronchial Asthma",
    "10": "Hypertension ",
    "11": "Migraine",
    "12": "Cervical Spondylosis",
    "13": "Paralysis (brain hemorrhage)",
    "14": "Jaundice",
    "15": "Malaria",
    "16": "Chickenpox",
    "17": "Dengue",
    "18": "Typhoid",
    "19": "Hepatitis A",
    "20": "Hepatitis B",
    "21": "Hepatitis C",
    "22": "Hepatitis D",
    "23": "Hepatitis E",
    "24": "Alcoholic Hepatitis",
    "25": "Tuberculosis",
    "26": "Common Cold",
    "27": "Pneumonia",
    "28": "Dimorphic Hemmorhoids (piles)",
    "29": "Heart Attack",
    "30": "Varicose Veins",
    "31": "Hypothyroidism",
    "32": "Hyperthyroidism",
    "33": "Hypoglycemia",
    "34": "Osteoarthritis",
    "35": "Arthritis",
    "36": "Vertigo",
    "37": "Acne",
    "38": "Urinary Tract Infection",
    "39": "Psoriasis",
    "40": "Impetigo"
  },
  "initializer_range": 0.02,
  "label2id": {
    "AIDS": 6,
    "Acne": 37,
    "Alcoholic Hepatitis": 24,
    "Allergy": 1,
    "Arthritis": 35,
    "Bronchial Asthma": 9,
    "Cervical Spondylosis": 12,
    "Chickenpox": 16,
    "Chronic Cholestasis": 3,
    "Common Cold": 26,
    "Dengue": 17,
    "Diabetes ": 7,
    "Dimorphic Hemmorhoids (piles)": 28,
    "Drug Reaction": 4,
    "Fungal Infection": 0,
    "GERD": 2,
    "Gastroenteritis": 8,
    "Heart Attack": 29,
    "Hepatitis A": 19,
    "Hepatitis B": 20,
    "Hepatitis C": 21,
    "Hepatitis D": 22,
    "Hepatitis E": 23,
    "Hypertension ": 10,
    "Hyperthyroidism": 32,
    "Hypoglycemia": 33,
    "Hypothyroidism": 31,
    "Impetigo": 40,
    "Jaundice": 14,
    "Malaria": 15,
    "Migraine": 11,
    "Osteoarthritis": 34,
    "Paralysis (brain hemorrhage)": 13,
    "Peptic Ulcer Disease": 5,
    "Pneumonia": 27,
    "Psoriasis": 39,
    "Tuberculosis": 25,
    "Typhoid": 18,
    "Urinary Tract Infection": 38,
    "Varicose Veins": 30,
    "Vertigo": 36
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 119547
}
